; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v8 - type_2 ?v1 - type_1)
 	      (pred_4 ?v6 - object ?v1 - type_1)
	      (pred_1 ?v8 - type_2 ?v4 - type_3)
	      (pred_3 ?v8 - type_2 ?v6 - object ?v4 - type_3))

   (:action op_2
       :parameters  (?v8 - type_2 ?v3 ?v7 - type_1)
       :precondition (and  (pred_2 ?v8 ?v3))
       :effect (and  (pred_2 ?v8 ?v7)
		     (not (pred_2 ?v8 ?v3))))

   (:action op_1
       :parameters (?v8 - type_2 ?v2 - object ?v5 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v5) (pred_2 ?v8 ?v5) (pred_1 ?v8 ?v4))
       :effect (and (pred_3 ?v8 ?v2 ?v4)
		    (not (pred_4 ?v2 ?v5)) 
		    (not (pred_1 ?v8 ?v4))))

   (:action op_3
       :parameters (?v8 - type_2 ?v2 - object ?v5 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v8 ?v2 ?v4) (pred_2 ?v8 ?v5))
       :effect (and (pred_4 ?v2 ?v5)
		    (pred_1 ?v8 ?v4)
		    (not (pred_3 ?v8 ?v2 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_02 - type_2
obj_10 obj_07 obj_12 obj_01 - type_3
obj_13 obj_03 obj_08 obj_06 - type_1
obj_11 obj_05 obj_09 obj_14 - object)
(:init
(pred_2 obj_04 obj_08)
(pred_1 obj_04 obj_10)
(pred_1 obj_04 obj_07)
(pred_2 obj_02 obj_03)
(pred_1 obj_02 obj_12)
(pred_1 obj_02 obj_01)
(pred_4 obj_11 obj_13)
(pred_4 obj_05 obj_06)
(pred_4 obj_09 obj_13)
(pred_4 obj_14 obj_06)
)
(:goal
(and
(pred_4 obj_11 obj_08)
(pred_4 obj_05 obj_13)
(pred_4 obj_09 obj_03)
(pred_4 obj_14 obj_13)
)
)

(:constraints
  (always (not (pred_2 obj_04 obj_06)))
)
)

; plan
1. (op_2 obj_04 obj_08 obj_03)
   deleted: (pred_2 obj_04 obj_08)
   added: (pred_2 obj_04 obj_03)
   goals met: 0 of 4
2. (op_2 obj_02 obj_03 obj_06)
   deleted: (pred_2 obj_02 obj_03)
   added: (pred_2 obj_02 obj_06)
   goals met: 0 of 4
3. (op_1 obj_02 obj_14 obj_06 obj_01)
   deleted: (pred_4 obj_14 obj_06) (pred_1 obj_02 obj_01)
   added: (pred_3 obj_02 obj_14 obj_01)
   goals met: 0 of 4
4. (op_1 obj_02 obj_05 obj_06 obj_12)
   deleted: (pred_4 obj_05 obj_06) (pred_1 obj_02 obj_12)
   added: (pred_3 obj_02 obj_05 obj_12)
   goals met: 0 of 4
5. (op_2 obj_04 obj_03 obj_13)
   deleted: (pred_2 obj_04 obj_03)
   added: (pred_2 obj_04 obj_13)
   goals met: 0 of 4
6. (op_2 obj_02 obj_06 obj_13)
   deleted: (pred_2 obj_02 obj_06)
   added: (pred_2 obj_02 obj_13)
   goals met: 0 of 4
7. (op_1 obj_04 obj_09 obj_13 obj_07)
   deleted: (pred_4 obj_09 obj_13) (pred_1 obj_04 obj_07)
   added: (pred_3 obj_04 obj_09 obj_07)
   goals met: 0 of 4
8. (op_1 obj_04 obj_11 obj_13 obj_10)
   deleted: (pred_4 obj_11 obj_13) (pred_1 obj_04 obj_10)
   added: (pred_3 obj_04 obj_11 obj_10)
   goals met: 0 of 4
9. (op_3 obj_02 obj_14 obj_13 obj_01)
   deleted: (pred_3 obj_02 obj_14 obj_01)
   added: (pred_4 obj_14 obj_13) (pred_1 obj_02 obj_01)
   goals met: 1 of 4
10. (op_3 obj_02 obj_05 obj_13 obj_12)
   deleted: (pred_3 obj_02 obj_05 obj_12)
   added: (pred_4 obj_05 obj_13) (pred_1 obj_02 obj_12)
   goals met: 2 of 4
11. (op_2 obj_04 obj_13 obj_03)
   deleted: (pred_2 obj_04 obj_13)
   added: (pred_2 obj_04 obj_03)
   goals met: 2 of 4
12. (op_3 obj_04 obj_09 obj_03 obj_07)
   deleted: (pred_3 obj_04 obj_09 obj_07)
   added: (pred_4 obj_09 obj_03) (pred_1 obj_04 obj_07)
   goals met: 3 of 4
13. (op_2 obj_04 obj_03 obj_08)
   deleted: (pred_2 obj_04 obj_03)
   added: (pred_2 obj_04 obj_08)
   goals met: 3 of 4
14. (op_3 obj_04 obj_11 obj_08 obj_10)
   deleted: (pred_3 obj_04 obj_11 obj_10)
   added: (pred_4 obj_11 obj_08) (pred_1 obj_04 obj_10)
   goals met: 4 of 4
